cases/artigo_mestrado/old/pipe-fsi-solid/fluid/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

// Kinematic pressure (p/rho, m2/s2).
// p_inlet = 0.4 m2/s2 → 0.4 * 1000 = 400 Pa ≈ 3 mmHg IOP difference.
// p_outlet = 0 (reference).
// The barrier is loaded by the full pressure difference (400 Pa).

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    // Vitreous chamber side: maintained at IOP pressure
    inlet
    {
        type            fixedValue;
        value           uniform 0.4;
    }

    // Anterior chamber side: reference (drainage)
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    top
    {
        type            zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }

    interface
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}
