cases/artigo_mestrado/old/pipe-fsi-solid/fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       3704;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       3724;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          96;
        startFace       3744;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          96;
        startFace       3840;
    }
    interface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       3936;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3840;
        startFace       3976;
    }
)

// ************************************************************************* //
