cases/artigo_mestrado/old/pipe-fsi-solid/fluid/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// Aqueous humour approximated as water: nu = 1e-3 m2/s

transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 1e-3;
